"""
- ack
    * پیام انجام شدن کار است که به بروکر ارسال میشود
    * اگه ارسال نشود پیام حذف نمیشود
- انواع‌ش
    * اتومات
        ~ --> 5
        ~ به محضی که مقصد پیام را بگیرد حذف میشود
    * دستی
        ~ --> 9
        ~ بعد از اینکه مقصد پیام را گرفت هر زمان که تعیین شود حذف میشود

- properties
    * ویژگی‌ها و اطلاعات اضافه‌ی پیام‌ها هستند

- method (meta-data)
    * Delivery tag
        ~ method.delivery_tag
        ~ کد پیام
    * Redelivered
    * Exchange
    * Routing key
    * Consumer tag

"""
