"""
- برنامه رو تحت نظر میگیره و اگه یه اتفاق خاصی افتاد به ما یه سیگنال میفرسته

- Signals
    * pre_save / post_save
        ~ قبل/ بعد از سیو شدن یه دیتا سیگنال ارسال میکنه
    * pre_delete / post_delete
        ~ قبل / بعد از حذف شدن یه دیتا سیگنال ارسال میکنه
    * m2m_changed
        ~ اگه یه تغییر تو رابطه
        ~ M2M: ManyToManyField
        ~اتفاق بیوفته سیگنال ارسال میشه
    * request_started / request_finished
        ~ اگه یه درخواست شروع / تموم بشه سیگنال ارسال میکنه

- طریقه وصل شدن
    * <Signal>.connect(
        receiver= <تابعی که سیگنال رو قراره بگیره>,
        sender= <مدلی که قراره ازش سیگنال بیاد>,
    )
"""

