"""
- .
    - هر حرفی میتونه باشه بجز نیولاین
    - و یه کارکتر باید باشه

- ^
    - ابتدای استرینگ رو مچ میکنه
    - اول استرینگ رو با فلان شروع بشه

- $
    - آخر خط رو مچ میکنه
    - آخر استرینگ با فلان تموم بشه

- Flags
    - متد‌هایی هستن که رفتار ریجکس رو عوض میکنن
    - ex:
        - Insensitive
            - حساسیت به حروف بزرگ و کوچک رو غیرفعال میکنه
        - global
            - همه‌ی مچ‌ها رو برمیگردونه
        - multi-line
            - استرینگ رو بصورت چند استرینگ مچ میکنه
        - dotall
            - نقطه نیولاین‌ها رو قبول کنه

"""
