"""
- \d
    - مچ کردن تمام اعداد

- \D
    - هرچیزی بجز اعداد

- \s
    - مچ کردن تمام فاصله‌ها
    - space, new-line

- \S
    - هرچیزی بجز فاصله‌ها

- \w
    - مچ‌کردن تمام حروف و اعداد
    - word, number, _

- \W
    - هرچیزی بجز حروف و اعداد

- \b
    - قبل یا بعد از این کلمه چیز دیگه‌ای نباشه

- \B
    - قبل یا بعد از این کلمه چیز دیگه‌ای باشه

- \A...
    - کلمه اول استرینگ باشه

- ...\Z
    - آخر استرینگ باشه

- ...|...
    - یا

- ()
    - دسته‌بندی کلمه‌ها
    - ex: (a|c|b)ello
        - aello, cello, bello

"""
