"""Virtual Environment(venv)"""
# نصب پکیج ها در محیط مجازی جدا(در سیستم نصب نمی شود)

"""روش اول"""
# نیاز به نصب پکیج دارد:|
# pip install virtualenv

# تایپ متن پایین در سی ام دی فایل مورد نظر
# virtualenv [venv](نام فایل انتخابی)
#                   -------------> ساخت محیط مجازی در فایل مورد نظر

# .\venv\Scripts\activate
#                   -------------> وارد محیط مجازی شدن

# pip freeze
#                   -------------> نمایش پکیج های نصب شده در محیط مجازی

# pip install pandas
#                   -------------> نصب پکیج در محیط مجازی

# pip install -r requirements.txt
#                   -------------> نصب چندین پکیج با هم

# deactivate
#                   -------------> از محیط مجازی خارج شدن

"""روش دوم"""
# نیاز به نصب پکیج ندارد:|

# تایپ متن پایین در سی ام دی فایل مورد نظر
# python -m venv venv(نام فایل انتخابی)
#                   -------------> ساخت محیط مجازی در فایل مورد نظر

# بقیه مشترک