"""
- گیت یک نرم افزار برای ثبت تغییرات اعمال شده بروی پروژه است. 
در زمان گسترش پروژه امکان بروز مشکل وجود دارد یا ممکن است کاربران از تغییرات جدید ایجاد شده بروی پروژه راضی نباشند. 
اگر از گیت استفاده نکرده باشیم برگرداندن تغییرات کار مشکلی است. 
اما با استفاده از گیت میتوان تغییرات را علامت گذاری کرده و در صورت نیاز میتوان با استفاده از یک دستور پروژه را به حالت قبل برگرداند


- کانفیگ کردن گیت
git config --global user.name "<username>"
git config --global user.email "<email>"
git config --global user.password "<api-key>"


- دیدن کانفیگ‌ها
git config --list


"""
