"""
- revert
    * این اجازه رو میده که تغییراتی که تو کامیت ایجاد کردین رو حذف کنین
    * قدرتش از چک‌اوت بیشتره
    * کامیت رو حذف نمیکنه!
    * یه کامیت جدید ایجاد میکنه و تغییرات کامیت قبلی رو حذف میکنه
    * git revert <hash-riz>

- نکته اخلاقی
    * فک کن یه فایلو تو یه کامیت تغییر دادیم و بعد تو یه کامیت دیگه حذفش کردیم
    * خب اگه بخوایم کامیت قبل‌تر (تغییر فایله رو) ریورت کنیم
    * به مشکل میخوریم
    * پس ریورت رو واسه آخریا استفاده کنین
    * واسه وسطیا از ریست (فایل بعد) استفاده کن

"""