"""
- ابزارهایی هستن که میذارن شکل فیلتر کردن رو عوض کنیم
- ex: Entry.objects.get(id__exact=14)
- ex: Entry.objects.get(pub_date__year__gte=2005)

- انواعش:
    * exact
        ~ دقیقا همون مقدار باشه
    * iexact
        ~ به حروف بزرگ و کوچک حساس نباشه
    * contains
        ~ شامل این مقدار باشه
    * in
        ~ داخل این لیست باشه
        ~ ex: Entry.objects.filter(id__in=[1, 2, 3])
    * gt
        ~ بزرگتر از فلان باشه
    * gte
        ~ بزرگتر یا مساوی
    * lt
        ~ کوچکتر
    * lte
        ~ کوچکتر یا مساوی
    * startswith
        ~ با فلان شروع شده باشه
    * istartswith
        ~ بالایی بدون حساسیت به حروف بزرگ و کوچیک
    * endswith
        ~ با فلان تموم شده باشه
    * iendswith
        ~ بالایی بدون حساسیت به حروف بزرگ و کوچیک
    * range
        ~ تو محدوده فلان باشه
        ~ مثال: بین تاریخ فلان تا بهمان رو بده
    * date, year, ...

"""

