"""

- یه زبون همه منظوره‌س:
    * میشه ازش برای ساخت هربرنامه‌ای استفاده کرد

- مزایا: 
    * شبیه انگلیسیه
    * بهینه‌س
    * تفسیر شده‌س
    * کتابخونه استانداردش خیلی بزرگه
    * داینامیک تایپه (dynamic type)
        + نیاز نیس تایپ متغیر رو موقع ساختش تعیین کرد
        + میشه متغیر رو تغییر داد

- معایب:
    * سرعت‌ش کمه
    * حافظه زیاد لازم داره
    * زبان تایپ پویاس > نوع داده هرزمان میتونه تغییر کنه > نیاز به آزمایش کامل برنامه داره

- متغیرهای پایتون تو رم ذخیره میشه

"""
