"""
- ویژگی لیست‌ها:
    * ترتیب‌شون حفظ میشه : ordered
    * هرنوع آبجکتی رو میتونن ذخیره کنن
    * به آیتم‌های درون لیست میشه با ایندکس دسترسی داشت
    * می‌تونن تا عمق دلخواه تودرتو باشن
    * تغییر پذیرن
    *‌ پویا هستن > تعداد آیتم‌ها رو میشه کم و زیاد کرد
"""
x = False
a = [
    True, 
    'bar',
    [34, x],
    2.384
]

"""
- دسترسی به آیتم‌های لیست
    * indexing
        ~ دسترسی به یه آیتم
    * slicing
        ~ دسترسی به چند آیتم
"""

# indexing
print(
    'indexing:',
    a[0],
    a[-2],
)

# slicing
print(
    'slicing:',
    a[2:4],
    a[0:3:2]
)

# اضافه کردن به لیست
a.append(54)

# حذف از لیست
a[2:4] = []

