"""
- تابع
    * قطعه کدیست که فقظ در زمان فراخوانی اجرا میشه
    * پایتون دارای 71 تابع داخلیه

def func_name(...):
    ...
    return ...

func_name(...)

- انواع تابع
    * Buit-in Functions
        ~ توابع داخلی
    * User-Defined Functions
        ~ توابع ساخته شده توسط کاربر
    * Anonymous Functions
        ~ توابع ناشناس

- توابع ناشناس:
    * توابعی که بدون نامند

- انواع آرگومان:
    * اجباری
    * کلیدواژه
    * آرگومان‌هایی با مقدار پیش فرض
    * آرگومان‌های کلیدواژه با تعداد نامشخص

"""

# توابع ناشناس
x = lambda i: i**2
print(x(2))
